Repository: BlindHelp/updateChannel
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es, fr

source: Default
es: Predeterminado
fr: Défaut

source: Stable
es: Estable

source: Stable, rc and beta
es: Estable, rc y beta
fr: Stable, rc et bêta

source: Alpha (snapshots)
es: Alfa (versiones de desarrollo)
fr: Alpha (versions de développement)

source: Disable updates (not recommended)
es: Deshabilitar actualizaciones (no recomendado)
fr: Désactiver les mises à jour (non recommandées)

source: Update channel
es: Canal de actualización
fr: Canal de mise à jour

source: View changelog
es: Ver registro de cambios
fr: Voir journal des changements

source: {channelInfo} (apiVersion {APIVersion})
es: {channelInfo} (versión de API {APIVersion})
fr: {channelInfo} (version de l'API {APIVersion})

source: Download now %s
es: Descargar %s ahora
fr: Télécharger %s maintenant

source: Fail retrieving update info
es: Fallo al recuperar información sobre las actualizaciones
fr: Échec lors de la récupération des informations sur les mises à jour

source: Already updated
es: Actualizada
fr: Mise à jour

source: searching update info
es: buscando información de actualizaciones
fr: recherche en cours d'informations sur les mises à jour

source: Current version: {version} build {version_build}
es: Versión actual: {version} compilación {version_build}
fr: Version actuelle: {version} compilation {version_build}

source: Update channel selector
es: Selector del canal de actualización
fr: Sélecteur du canal de mise à jour

source: This add-on allows you to switch quickly between NVDA snapshots and release types. Go to the update channel category on the NVDA settings dialog, choose your update channel and check for updates from the NVDA help menu. Choose the stable option and update again to return to an official release.
es: Este complemento te permite cambiar rápidamente entre tipos de versiones de desarrollo de NVDA y liberaciones. Ve a la categoría Canal de actualización en el diálogo de opciones de NVDA, elige tu canal de actualización y busca actualizaciones desde el menú Ayuda de NVDA. Elige la opción estable y actualiza de nuevo para volver a una liberación oficial.
fr: Cette extension vous permet de changer rapidement entre les types de versions de développement de NVDA et releases. Accédez à la catégorie Canal de mise à jour du dialogue Paramètres de NVDA, choisissez votre canal de mise à jour et recherchez des mises à jour à partir du menu Aide de NVDA. Choisissez l'option stable et mettez à jour à nouveau pour revenir à une version officielle.
